In [1]:
#import important module
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn

In [2]:
#Load data
data = pd.read_csv("pizza_v2.csv")

### Analysing Preparing the Dataset

In [3]:
data.head(5)

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,A,"Rp235,000",22 inch,chicken,double_signature,jumbo,yes,yes,no
1,A,"Rp198,000",20 inch,papperoni,double_signature,jumbo,yes,yes,no
2,A,"Rp120,000",16 inch,mushrooms,double_signature,reguler,yes,yes,yes
3,A,"Rp155,000",14 inch,smoked_beef,double_signature,reguler,yes,no,yes
4,A,"Rp248,000",18 inch,mozzarella,double_signature,jumbo,yes,no,yes

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company          129 non-null    object
 1   price_rupiah     129 non-null    object
 2   diameter         129 non-null    object
 3   topping          129 non-null    object
 4   variant          129 non-null    object
 5   size             129 non-null    object
 6   extra_sauce      129 non-null    object
 7   extra_cheese     129 non-null    object
 8   extra_mushrooms  129 non-null    object
dtypes: object(9)
memory usage: 9.2+ KB

In [5]:
data.describe()

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
count,129,129,129,129,129,129,129,129,129
unique,5,43,12,12,20,6,2,2,2
top,C,"Rp72,000",12 inch,chicken,classic,medium,yes,yes,yes
freq,30,11,49,29,30,41,76,86,72

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company          129 non-null    object
 1   price_rupiah     129 non-null    object
 2   diameter         129 non-null    object
 3   topping          129 non-null    object
 4   variant          129 non-null    object
 5   size             129 non-null    object
 6   extra_sauce      129 non-null    object
 7   extra_cheese     129 non-null    object
 8   extra_mushrooms  129 non-null    object
dtypes: object(9)
memory usage: 9.2+ KB

Here we found the Dtype of diameter and size are object so we change the dtype of daimeter and size in numerical

In [7]:
# converting the Object data like price and diameter to numerical
data.head(5)

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,A,"Rp235,000",22 inch,chicken,double_signature,jumbo,yes,yes,no
1,A,"Rp198,000",20 inch,papperoni,double_signature,jumbo,yes,yes,no
2,A,"Rp120,000",16 inch,mushrooms,double_signature,reguler,yes,yes,yes
3,A,"Rp155,000",14 inch,smoked_beef,double_signature,reguler,yes,no,yes
4,A,"Rp248,000",18 inch,mozzarella,double_signature,jumbo,yes,no,yes

In [8]:
# remove the Rp and inch in price and diameter
data['price_rupiah']=data['price_rupiah'].apply(lambda x : x.replace("Rp","").replace(",",""))
data['diameter']=data['diameter'].apply(lambda x : x.replace(" inch",""))

In [9]:
data.head(5)

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,A,235000,22,chicken,double_signature,jumbo,yes,yes,no
1,A,198000,20,papperoni,double_signature,jumbo,yes,yes,no
2,A,120000,16,mushrooms,double_signature,reguler,yes,yes,yes
3,A,155000,14,smoked_beef,double_signature,reguler,yes,no,yes
4,A,248000,18,mozzarella,double_signature,jumbo,yes,no,yes

In [10]:
data['price_rupiah']=data['price_rupiah'].astype(float)
data['diameter']=data['diameter'].astype(float)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company          129 non-null    object
 1   price_rupiah     129 non-null    float64
 2   diameter         129 non-null    float64
 3   topping          129 non-null    object
 4   variant          129 non-null    object
 5   size             129 non-null    object
 6   extra_sauce      129 non-null    object
 7   extra_cheese     129 non-null    object
 8   extra_mushrooms  129 non-null    object
dtypes: float64(2), object(7)
memory usage: 9.2+ KB

In [12]:
data.head(4)

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,A,235000.0,22.0,chicken,double_signature,jumbo,yes,yes,no
1,A,198000.0,20.0,papperoni,double_signature,jumbo,yes,yes,no
2,A,120000.0,16.0,mushrooms,double_signature,reguler,yes,yes,yes
3,A,155000.0,14.0,smoked_beef,double_signature,reguler,yes,no,yes

### Checking for categories under each categorical feature

In [13]:
data['topping'].unique()

array(['chicken', 'papperoni', 'mushrooms', 'smoked_beef', 'mozzarella',
       'black_papper', 'tuna', 'meat', 'sausage', 'onion', 'vegetables',
       'beef'], dtype=object)

In [14]:
data['variant'].unique()

array(['double_signature', 'american_favorite', 'super_supreme',
       'meat_lovers', 'double_mix', 'classic', 'crunchy', 'new_york',
       'double_decker', 'spicy_tuna', 'BBQ_meat_fiesta', 'BBQ_sausage',
       'extravaganza', 'meat_eater', 'gournet_greek', 'italian_veggie',
       'thai_veggie', 'american_classic', 'neptune_tuna', 'spicy tuna'],
      dtype=object)

In [15]:
data['size'].unique()

array(['jumbo', 'reguler', 'small', 'medium', 'large', 'XL'], dtype=object)

In [16]:
data['extra_sauce'].unique()

array(['yes', 'no'], dtype=object)

In [17]:
data['extra_mushrooms'].unique()

array(['no', 'yes'], dtype=object)

### Encoding Categorical Features

In [18]:
# import LabelEncoder
from sklearn.preprocessing import LabelEncoder

In [19]:
en = LabelEncoder()
catCols = ['company','topping','variant','size','extra_mushrooms','extra_cheese','extra_sauce']
for col in catCols:
    data[col]=en.fit_transform(data[col])
# due to encoding we convert the categorical features to numerical features

In [20]:
data.head()

,company,price_rupiah,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,0,235000.0,22.0,2,8,1,1,1,0
1,0,198000.0,20.0,7,8,1,1,1,0
2,0,120000.0,16.0,5,8,4,1,1,1
3,0,155000.0,14.0,9,8,4,1,0,1
4,0,248000.0,18.0,4,8,1,1,0,1

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129 entries, 0 to 128
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company          129 non-null    int32
 1   price_rupiah     129 non-null    float64
 2   diameter         129 non-null    float64
 3   topping          129 non-null    int32
 4   variant          129 non-null    int32
 5   size             129 non-null    int32
 6   extra_sauce      129 non-null    int32
 7   extra_cheese     129 non-null    int32
 8   extra_mushrooms  129 non-null    int32
dtypes: float64(2), int32(7)
memory usage: 5.7 KB

Whole dataset is in numerical from now!!

## Splitting into X and Y

In [22]:
y=data["price_rupiah"]
x=data.drop("price_rupiah",axis = 1)
# drop price_rupiah for trainging the data

In [23]:
x.head(5)

,company,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
0,0,22.0,2,8,1,1,1,0
1,0,20.0,7,8,1,1,1,0
2,0,16.0,5,8,4,1,1,1
3,0,14.0,9,8,4,1,0,1
4,0,18.0,4,8,1,1,0,1

In [24]:
y.head(5)

0    235000.0
1    198000.0
2    120000.0
3    155000.0
4    248000.0
Name: price_rupiah, dtype: float64

In [25]:
y=pd.DataFrame(y)

In [26]:
y.head()

   price_rupiah
0      235000.0
1      198000.0
2      120000.0
3      155000.0
4      248000.0

In [27]:
# import train test split
from sklearn.model_selection import train_test_split

In [28]:
x_train,x_test,y_train,y_test = train_test_split(x,y,train_size=0.8,test_size=0.2,random_state=0)

In [29]:
x_train.head()

,company,diameter,topping,variant,size,extra_sauce,extra_cheese,extra_mushrooms
120,4,14.0,4,4,2,1,1,0
16,0,16.0,9,13,1,0,1,1
89,3,8.5,4,4,5,1,0,1
119,4,12.0,5,4,3,1,1,0
13,0,12.0,1,18,4,0,1,0

In [30]:
y_train.head()

     price_rupiah
120       72000.0
16       110000.0
89        23500.0
119       46000.0
13        90000.0

## XGB Regressor

In [31]:
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor
import sklearn.metrics as metrics

In [32]:
from xgboost import XGBRegressor
from sklearn.metrics import mean_absolute_error

#### Improved XGB Regressor

In [40]:
# Define the model
model2=XGBRegressor(n_estimators=1000, learning_rate=0.01, max_depth=10)

# Fit the model
model2.fit(x_train,y_train)

# Get Predictions
predictions2 = model2.predict(x_test)
print("predictions ",predictions2,'\n','\n')

# Calculate MAE
mae2 = mean_absolute_error(predictions2,y_test)
print("Mean Absolute Error :", mae2,'\n')

# Calculating R2
r22= metrics.r2_score(y_test,predictions2)
print("R2 Score ", r22)

predictions  [ 65716.47  148955.98   70429.71   97010.71   72757.01   83844.48
  48166.844  83844.48   39423.023  64979.734  99898.164 146013.19
  46285.484  87636.51   90649.695  88566.57  135344.81   79329.14
  67549.21   47148.227 115333.734  68466.82   98663.98   58399.652
  57120.24   39395.69 ]


Mean Absolute Error : 5167.389573317308

R2 Score  0.9386071733668582